### 6. 합성

In [1]:
import numpy as np
import pandas as pd

- merge

In [2]:
df1 = pd.DataFrame({
    '고객번호': [1001, 1002, 1003, 1004, 1005, 1006, 1007],
    '이름': ['둘리', '도우너', '또치', '길동', '희동', '마이콜', '영희']
}, columns=['고객번호', '이름'])
df1

   고객번호   이름
0  1001   둘리
1  1002  도우너
2  1003   또치
3  1004   길동
4  1005   희동
5  1006  마이콜
6  1007   영희

In [3]:
df2 = pd.DataFrame({
    '고객번호': [1001, 1001, 1005, 1006, 1008, 1001],
    '금액': [10000, 20000, 15000, 5000, 100000, 30000]
}, columns=['고객번호', '금액'])
df2

   고객번호      금액
0  1001   10000
1  1001   20000
2  1005   15000
3  1006    5000
4  1008  100000
5  1001   30000

In [4]:
# Inner join - 컬럼명이 같은 열(고객번호)을 기준으로, 공통된 데이터만 합성
pd.merge(df1, df2)

   고객번호   이름     금액
0  1001   둘리  10000
1  1001   둘리  20000
2  1001   둘리  30000
3  1005   희동  15000
4  1006  마이콜   5000

In [5]:
# Full outer join
pd.merge(df1, df2, how='outer')

   고객번호   이름        금액
0  1001   둘리   10000.0
1  1001   둘리   20000.0
2  1001   둘리   30000.0
3  1002  도우너       NaN
4  1003   또치       NaN
5  1004   길동       NaN
6  1005   희동   15000.0
7  1006  마이콜    5000.0
8  1007   영희       NaN
9  1008  NaN  100000.0

In [6]:
# Left outer join
pd.merge(df1, df2, how='left')

   고객번호   이름       금액
0  1001   둘리  10000.0
1  1001   둘리  20000.0
2  1001   둘리  30000.0
3  1002  도우너      NaN
4  1003   또치      NaN
5  1004   길동      NaN
6  1005   희동  15000.0
7  1006  마이콜   5000.0
8  1007   영희      NaN

In [7]:
# right outer join
pd.merge(df1, df2, how='right')

   고객번호   이름      금액
0  1001   둘리   10000
1  1001   둘리   20000
2  1005   희동   15000
3  1006  마이콜    5000
4  1008  NaN  100000
5  1001   둘리   30000

- join method

In [8]:
# 인덱스로 조인
df1.set_index('고객번호', inplace=True)
df2.set_index('고객번호', inplace=True)

In [9]:
df1.join(df2)       # left outer join

       이름       금액
고객번호
1001   둘리  10000.0
1001   둘리  20000.0
1001   둘리  30000.0
1002  도우너      NaN
1003   또치      NaN
1004   길동      NaN
1005   희동  15000.0
1006  마이콜   5000.0
1007   영희      NaN

In [12]:
pd.merge(df1, df2, left_index=True, right_index=True)

       이름     금액
고객번호
1001   둘리  10000
1001   둘리  20000
1001   둘리  30000
1005   희동  15000
1006  마이콜   5000

- 연습 문제 4.6.1

In [20]:
df3 = pd.DataFrame(np.random.randint(100, 110, size=(5,5)), columns=list('ABCDE'))
df3

     A    B    C    D    E
0  106  109  107  105  107
1  104  104  109  105  104
2  107  102  101  108  106
3  103  106  105  101  101
4  108  104  106  101  101

In [21]:
df4 = pd.DataFrame(np.random.randint(100, 110, size=(5,5)), columns=list('ABXYZ'))
df4

     A    B    X    Y    Z
0  106  103  104  100  103
1  101  107  109  102  101
2  109  103  107  109  102
3  107  104  106  101  108
4  103  108  106  105  107

In [25]:
df4.B[0] = 109
df4

     A    B    X    Y    Z
0  106  109  104  100  103
1  101  107  109  102  101
2  109  103  107  109  102
3  107  104  106  101  108
4  103  108  106  105  107

In [26]:
pd.merge(df3, df4, on='A')

     A  B_x    C    D    E  B_y    X    Y    Z
0  106  109  107  105  107  109  104  100  103
1  107  102  101  108  106  104  106  101  108
2  103  106  105  101  101  108  106  105  107

In [27]:
pd.merge(df3, df4, on='B')

   A_x    B    C    D    E  A_y    X    Y    Z
0  106  109  107  105  107  106  104  100  103
1  104  104  109  105  104  107  106  101  108
2  108  104  106  101  101  107  106  101  108

In [28]:
pd.merge(df3, df4, on=['A','B'])

     A    B    C    D    E    X    Y    Z
0  106  109  107  105  107  104  100  103

- concat

In [29]:
df5 = pd.DataFrame(np.random.randint(500, 1000, size=(6, 2)) * 1000,
                   columns=['매출', '비용'], index=list('123456'))
df5['이익'] = df5['매출'] - df5['비용']
df5

       매출      비용      이익
1  793000  567000  226000
2  821000  862000  -41000
3  873000  518000  355000
4  768000  555000  213000
5  984000  830000  154000
6  612000  774000 -162000

In [30]:
df6 = pd.DataFrame(np.random.randint(500, 1000, size=(6, 2)) * 1000,
                   columns=['매출', '비용'], 
                   index=['7','8','9','10','11','12'])
df6['이익'] = df6['매출'] - df6['비용']
df6

        매출      비용      이익
7   575000  737000 -162000
8   696000  666000   30000
9   878000  842000   36000
10  867000  898000  -31000
11  932000  735000  197000
12  644000  994000 -350000

In [33]:
df7 = pd.concat([df5, df6])
df7

        매출      비용      이익
1   793000  567000  226000
2   821000  862000  -41000
3   873000  518000  355000
4   768000  555000  213000
5   984000  830000  154000
6   612000  774000 -162000
7   575000  737000 -162000
8   696000  666000   30000
9   878000  842000   36000
10  867000  898000  -31000
11  932000  735000  197000
12  644000  994000 -350000

In [34]:
df7.sum()

매출    9443000
비용    8978000
이익     465000
dtype: int64

In [41]:
df7.loc['합계'] = df7.sum()
df7.tail()

         매출       비용      이익
9    878000   842000   36000
10   867000   898000  -31000
11   932000   735000  197000
12   644000   994000 -350000
합계  9443000  8978000  465000